; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v11 ?v2)
             (pred_11 ?v8 ?v12)
             (pred_9 ?v11 ?v12)
             (pred_12 ?v6 ?v11 )
	     (pred_5 ?v11)
             (pred_6 ?v3)
             (pred_1 ?v8)
             (pred_3 ?v12)
             (pred_4 ?v11)
             (pred_10 ?v8)
             (pred_7 ?v11)
             (pred_8 ))



(:action op_3
:parameters (?v1 ?v5 ?v13 ?v9)
:precondition (and (pred_6 ?v1) (pred_6 ?v5) (pred_1 ?v13) (pred_3 ?v9)
          (pred_2 ?v1 ?v5) (pred_11 ?v13 ?v9)
                   (pred_9 ?v5 ?v9) (pred_5 ?v1) 
                   (pred_4 ?v5) (pred_10 ?v13))
:effect (and  (pred_7 ?v5) (not (pred_4 ?v5))))


(:action op_1
:parameters (?v1 ?v10)
:precondition (and (pred_6 ?v1) (pred_6 ?v10)
               (pred_5 ?v1) (pred_2 ?v1 ?v10) (pred_7 ?v10))
:effect (and (pred_5 ?v10) (not (pred_5 ?v1))))

(:action op_2
:parameters (?v1 ?v13)
:precondition (and (pred_6 ?v1) (pred_1 ?v13) 
                  (pred_5 ?v1) (pred_12 ?v13 ?v1) (pred_8 ))
:effect (and (pred_10 ?v13)
   (not (pred_12 ?v13 ?v1)) (not (pred_8 ))))


(:action op_5
:parameters (?v1 ?v4 ?v7)
:precondition (and (pred_6 ?v1) (pred_1 ?v4) (pred_1 ?v7)
                  (pred_5 ?v1) (pred_10 ?v7) (pred_12 ?v4 ?v1))
:effect (and (pred_10 ?v4) (pred_12 ?v7 ?v1)
        (not (pred_10 ?v7)) (not (pred_12 ?v4 ?v1))))

(:action op_4
:parameters (?v1 ?v13)
:precondition (and (pred_6 ?v1) (pred_1 ?v13) 
                  (pred_5 ?v1) (pred_10 ?v13))
:effect (and (pred_8 ) (pred_12 ?v13 ?v1) (not (pred_10 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_06 obj_31 obj_09 obj_11 obj_28 obj_17 obj_25 obj_18 obj_02 obj_24 obj_16 obj_05 obj_26 obj_27 obj_30 obj_12 obj_10 obj_04 obj_29 obj_21 obj_03 obj_08 obj_22 obj_13
    obj_23 obj_07 obj_14
    obj_20 obj_01 obj_15
    )

    (:init
       (pred_8)

       (pred_6 obj_19)
       (pred_6 obj_06)
       (pred_6 obj_31)
       (pred_6 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_28)
       (pred_6 obj_17)
       (pred_6 obj_25)
       (pred_6 obj_18)
       (pred_6 obj_02)
       (pred_6 obj_24)
       (pred_6 obj_16)
       (pred_6 obj_05)
       (pred_6 obj_26)
       (pred_6 obj_27)
       (pred_6 obj_30)
       (pred_6 obj_12)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_29)
       (pred_6 obj_21)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_22)
       (pred_6 obj_13)
       (pred_3 obj_23)
       (pred_3 obj_07)
       (pred_3 obj_14)
       (pred_1 obj_20)
       (pred_1 obj_01)
       (pred_1 obj_15)

       (pred_2 obj_19 obj_28)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_06 obj_17)
       (pred_2 obj_06 obj_31)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_31 obj_25)
       (pred_2 obj_31 obj_09)
       (pred_2 obj_31 obj_06)
       (pred_2 obj_09 obj_18)
       (pred_2 obj_09 obj_11)
       (pred_2 obj_09 obj_31)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_09)
       (pred_2 obj_28 obj_24)
       (pred_2 obj_28 obj_17)
       (pred_2 obj_28 obj_19)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_17 obj_25)
       (pred_2 obj_17 obj_06)
       (pred_2 obj_17 obj_28)
       (pred_2 obj_25 obj_05)
       (pred_2 obj_25 obj_18)
       (pred_2 obj_25 obj_31)
       (pred_2 obj_25 obj_17)
       (pred_2 obj_18 obj_26)
       (pred_2 obj_18 obj_02)
       (pred_2 obj_18 obj_09)
       (pred_2 obj_18 obj_25)
       (pred_2 obj_02 obj_27)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_18)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_24 obj_16)
       (pred_2 obj_24 obj_28)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_16 obj_05)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_24)
       (pred_2 obj_05 obj_10)
       (pred_2 obj_05 obj_26)
       (pred_2 obj_05 obj_25)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_26 obj_04)
       (pred_2 obj_26 obj_27)
       (pred_2 obj_26 obj_18)
       (pred_2 obj_26 obj_05)
       (pred_2 obj_27 obj_29)
       (pred_2 obj_27 obj_02)
       (pred_2 obj_27 obj_26)
       (pred_2 obj_30 obj_21)
       (pred_2 obj_30 obj_12)
       (pred_2 obj_30 obj_24)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_12 obj_10)
       (pred_2 obj_12 obj_16)
       (pred_2 obj_12 obj_30)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_05)
       (pred_2 obj_10 obj_12)
       (pred_2 obj_04 obj_22)
       (pred_2 obj_04 obj_29)
       (pred_2 obj_04 obj_26)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_29 obj_13)
       (pred_2 obj_29 obj_27)
       (pred_2 obj_29 obj_04)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_21 obj_30)
       (pred_2 obj_03 obj_08)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_08 obj_22)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_08 obj_03)
       (pred_2 obj_22 obj_13)
       (pred_2 obj_22 obj_04)
       (pred_2 obj_22 obj_08)
       (pred_2 obj_13 obj_29)
       (pred_2 obj_13 obj_22)
       (pred_4 obj_09)
       (pred_4 obj_29)
       (pred_4 obj_21)
       (pred_9  obj_09 obj_23)
       (pred_9  obj_29 obj_07)
       (pred_9  obj_21 obj_14)
       (pred_7 obj_19)
       (pred_7 obj_06)
       (pred_7 obj_31)
       (pred_7 obj_11)
       (pred_7 obj_28)
       (pred_7 obj_17)
       (pred_7 obj_25)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_24)
       (pred_7 obj_16)
       (pred_7 obj_05)
       (pred_7 obj_26)
       (pred_7 obj_27)
       (pred_7 obj_30)
       (pred_7 obj_12)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_22)
       (pred_7 obj_13)

       (pred_11  obj_20 obj_23)
       (pred_11  obj_01 obj_07)
       (pred_11  obj_15 obj_14)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_01 obj_26)
       (pred_12 obj_15 obj_11)
       (pred_5 obj_13)
    )

    (:goal (and
       (pred_12 obj_20 obj_19)
       (pred_12 obj_01 obj_25)
    ))
(:constraints
  (always (not (pred_5 obj_04)))
)
)

; plan
1. (op_1 obj_13 obj_22)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_22)
   goals met: 0 of 2
2. (op_1 obj_22 obj_08)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_08)
   goals met: 0 of 2
3. (op_1 obj_08 obj_10)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_10)
   goals met: 0 of 2
4. (op_1 obj_10 obj_05)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_05)
   goals met: 0 of 2
5. (op_1 obj_05 obj_26)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_26)
   goals met: 0 of 2
6. (op_2 obj_26 obj_01)
   deleted: (pred_12 obj_01 obj_26) (pred_8)
   added: (pred_10 obj_01)
   goals met: 0 of 2
7. (op_1 obj_26 obj_18)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_18)
   goals met: 0 of 2
8. (op_1 obj_18 obj_25)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_25)
   goals met: 0 of 2
9. (op_4 obj_25 obj_01)
   deleted: (pred_10 obj_01)
   added: (pred_8) (pred_12 obj_01 obj_25)
   goals met: 1 of 2
10. (op_1 obj_25 obj_17)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_17)
   goals met: 1 of 2
11. (op_2 obj_17 obj_20)
   deleted: (pred_12 obj_20 obj_17) (pred_8)
   added: (pred_10 obj_20)
   goals met: 1 of 2
12. (op_1 obj_17 obj_06)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_06)
   goals met: 1 of 2
13. (op_1 obj_06 obj_19)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_19)
   goals met: 1 of 2
14. (op_4 obj_19 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_8) (pred_12 obj_20 obj_19)
   goals met: 2 of 2
